"""
Выведите n-ое число Фибоначчи, используя только временные
переменные, циклические операторы и условные операторы. n - вводится
"""

n = int(input())
fib1, fib2 = 0, 1
for i in range(n - 1):
    fib1, fib2 = fib2, fib1 + fib2
print(fib1)
