"""
5. Уникальные элементы в списке
Дан список. Выведите те его элементы, которые встречаются
в списке только один раз. Элементы нужно выводить в том
порядке, в котором они встречаются в списке.
"""

lst = [1, 2, 1, 'b']
print(*[x for x in lst if lst.count(x) == 1])