"""
Даны два списка чисел. Посчитайте, сколько различных чисел
содержится одновременно как в первом списке, так и во втором.
"""

lst1 = [x**2 for x in range(100)]
lst2 = [x**3 for x in range(100)]
print(len(set(lst1).intersection(set(lst2))))
