"""
Языки
Каждый из N школьников некоторой школы знает Mi языков.
Определите, какие языки знают все школьники и языки,
которые знает хотя бы один из школьников.
Входные данные
Первая строка входных данных содержит количество школьников N.
Далее идет N чисел Mi, после каждого из чисел идет Mi строк,
содержащих названия языков, которые знает i-й школьник.
Пример:
3          - N количество школьников
2          - M1 количество языков первого школьника
Russian    - языки первого школьника
English
3          - M2 количество языков второго школьника
Russian
Belarusian
English
3
Russian
Italian
French

Выходные данные
В первой строке выведите количество языков, которые знают все
школьники. Начиная со второй строки - список таких языков.
Затем - количество языков, которые знает хотя бы один школьник,
на следующих строках - список таких языков.
"""

langs = {}
for number in range(int(input('количество школьников? '))):
    langs[number] = set()
    for _ in range(int(input('количество языков школьника? '))):
        langs[number].add(input('язык? '))
all_langs = set.intersection(*langs.values())
one_lang = set.union(*langs.values())
print(f'количество языков, которые знают все {len(all_langs)}\n'
      f'список таких языков {list(all_langs)}\n'
      f'количество языков, которые знает хотя бы один школьник '
      f'{len(one_lang)}\n'
      f'список таких языков {list(one_lang)}')
