str_ = """
Слова
Во входной строке     записан\nтекст. Словом считается
последовательность непробельных символов идущих подряд,
слова разделены одним или большим числом пробелов или
символами конца строки. Определите, сколько различных
слов содержится в этом тексте.
"""

str_lst = str_.split()
print('различных слов в этом тексте', len(set(str_lst)))
