"""
Оглянемся назад
Даны два натуральных числа. Вычислите их наибольший общий делитель
при помощи алгоритма Евклида (мы не знаем функции и рекурсию).
"""

small, big = 215484565498465686464846546846516841646568166851, 462
while big and small:
  if big > small:
    big %= small
  else:
    small %= big
print(big + small)
